<?php
//Task 1. Outputting the string "Hello world".
echo "<b>Task 1</b></br>";

$text1 = "Hello";
$text2 = "World";
$text2 = strtolower($text2);
echo "{$text1} {$text2}</br></br>";

//Task 2. Створити змінну $var і призначити їй значення 'hello'. Звертаючись до окремих символів цього рядка – вивести на екран символ 'h', символ 'e', символ 'o'.
echo "<b>Task 2</b></br>";

$var = 'hello';
echo "{$var[0]} {$var[1]} {$var[4]}</br></br>";

//Task 3. Якщо змінна $a більша нуля и менша 5-ти, то вивести 'Вірно', інакше вивести 'Невірно'. Перевірте роботу скрипта при $a, зі значеннями - 5, 0, -3, 2.
echo "<b>Task 3</b></br>";
$a = -5;
echo "{$a}"."</br>";

    if( $a>0 && $a<5 ){
        echo "Вірно"."</br></br>";
    }
    else{
        echo "Невірно"."</br></br>";
    }

//Task 4. Змінна $min має число від 0 до 59. Визначити в яку чверть години потрапляє число, відповідно вивести на екран одне з значень: «перша», «друга», «третя», «четверта».
echo "<b>Task 4</b></br>";

$min = random_int (0,59);
echo "min = {$min}</br>";

    if ($min>=0 && $min<=15) {
        echo "Перша</br></br>";
    } elseif ($min>=16 && $min<=30) {
        echo "Друга</br></br>";
    } elseif ( $min >=30 && $min<=45 ){
        echo "Третя</br></br>";
    } else {
        echo "Четверта</br></br>";
    }

//Task 5. В змінній $year збігається рік. Визначте чи є він високосним. Рік буде високосним в двох випадках: або він ділиться на 4, але при цьому не ділиться на 100, або ділиться на 400.
echo "<b>Task 5</b></br>";
$year = 2016;
echo "Year = {$year}</br>";
if ($year%4===0 && $year%100!==0 || $year%400===0) {
    echo "Рік є високосний</br></br>";
} else {
    echo "Рік не є високосний</br></br>";
}
//Task 6. Є рядок з 6-ти чисел (наприклад: 385934). Перевірте, чи сума перших трьох чисел дорівнює сумі других трьох чисел. Якщо це так – виведіть 'так' інакше – 'ні'.
echo "<b>"."Task 6"."</b>"."</br>";

$number = 385934;
echo "{$number}</br>";
$test = (string)$number;

$adition1 = $test[0]+$test[1]+$test[2];
$adition2 = $test[3]+$test[4]+$test[5];
    if ($adition1==$adition2) {
        echo "Так";
    } else {
        echo "Ні";
    }

?>